app/controllers/short_urls_controller.rb

INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('www.google.com', '2022-11-14 04:55:33.616262', '2022-11-14 04:55:33.616262')
---
  def create
    @short_url = ShortUrl.new(short_url_params)

    if @short_url.save