app/controllers/short_urls_controller.rb

SELECT `short_urls`.* FROM `short_urls`
---
  def index
    @short_urls = ShortUrl.all

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 1027 LIMIT 1
UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2022-11-15 03:23:45.797603' WHERE `short_urls`.`id` = 1033
---
  def show
    begin
      @single_url = ShortUrl.find(params[:id])
      @single_url.update_attribute(:click_count, @single_url.click_count += 1)

INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('www.canva.com', '2022-11-14 17:55:57.180315', '2022-11-14 17:55:57.180315')
---
  def create
    @short_url = ShortUrl.new(short_url_params)
    if @short_url.save

SELECT `short_urls`.* FROM `short_urls` ORDER BY `short_urls`.`click_count` DESC LIMIT 100
---
  def index
    @top = ShortUrl.order(click_count: :desc).limit(100)